Autodesk.Revit.DB.ExternalResourceLoadContent.Sync(Autodesk.Revit.DB.ExternalResourceLoadContent)
Syncs version and loadStatus with a given ExternalResourceLoadContent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContent.Version
The version of the external data that the server is providing in this object.
Remarks:
When its LoadResource() method is invoked, an IExternalResourceServer can
indicate the version of the data that it is providing to Revit by setting
this property.  Doing so will improve performance, because Revit will use
the version information to avoid unnecessary reloads.
See Autodesk.Revit.DB.IExternalResourceServer.GetResourceVersionStatus(Autodesk.Revit.DB.ExternalResourceReference).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015